/*
#school - ТУЕС
#class - 11Б
#num - 22
#name - Михаил Михайлов Здравков
#task - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото просто число в интервала [0; +∞) завършващо на x и да се запише като първи елемент в масива. Да се намери второто просто число в интервала [0;  +∞) завършващо на x и да се запише като втори елемент в масива. Аналогично да се намерят първите N прости числа в интервала [0;  +∞) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
*/

#include<iostream>
#include<math.h>
#include<stdlib.h>

using namespace std;

int primeCheck(int n){
    int i;

    for (i = 2; i <= n; i++)
    {
        if (n % i == 0 && n != i ) {
            return 0;
        }
    }
    return 1;
}

int main(){
    int x;
    int i, j = 0, array[10];

    cout<< "Enter 0<x<10: " <<endl;
    do{
        cin>> x;
    }while(x <= 0 || x >= 10);

    cout<<endl;
    cout<<endl;

    if (x == 5){
        cout << "5" <<endl;
        return 42;
    }

    for(i = 0; j < 10; i++){
        if (primeCheck(i) && (i % 10) == x){
            array[j] = i;
            cout<< array[j] <<endl;
            j++;
        }
    }
    
    return 0;
}

